{"pages":[{"title":"Angular Full-Stack","text":"Documentation Home Generators Available generators: App angular-fullstack (aka angular-fullstack:app) Server Side angular-fullstack:endpoint Client Side (via generator-ng-component) angular-fullstack:route angular-fullstack:component angular-fullstack:controller angular-fullstack:filter angular-fullstack:directive angular-fullstack:service angular-fullstack:provider angular-fullstack:factory angular-fullstack:decorator Deployment angular-fullstack:openshift angular-fullstack:heroku Injection A gulp task looks for new SCSS\/LESS\/Stylus files in your client\/app and client\/components folder and automatically injects them into the main style file (ex client\/app\/app.scss) based on an injection block. Configuration Yeoman generated projects can be further tweaked according to your needs by modifying project files appropriately. A .yo-rc file is generated for helping you copy configuration across projects, and to allow you to keep track of your settings. You can change this as you see fit. Testing Running gulp test will run the client and server unit tests with karma and mocha. Use gulp test:server to only run server tests. Use gulp test:client to only run client tests. Protractor tests To setup protractor e2e tests, you must first run npm run update-webdriver Use gulp test:e2e to have protractor go through tests located in the e2e folder. Code Coverage Use gulp test:coverage to run mocha-istanbul and generate code coverage reports. coverage\/server will be populated with e2e and unit folders containing the lcov reports. The coverage taget has 3 available options: test:coverage:unit generate server unit test coverage test:coverage:e2e generate server e2e test coverage test:coverage:check combine the coverage reports and check against predefined thresholds when no option is given test:coverage runs all options in the above order Debugging Use gulp serve:debug for a more debugging-friendly environment. Environment Variables Keeping your app secrets and other sensitive information in source control isn't a good idea. To have gulp launch your app with specific environment variables, add them to the git ignored environment config file: server\/config\/local.env.js. Project Structure Overview â\u0094\u009câ\u0094\u0080â\u0094\u0080 client â\u0094\u0082Â Â  â\u0094\u009câ\u0094\u0080â\u0094\u0080 app - All of our app specific components go in here â\u0094\u0082Â Â  â\u0094\u009câ\u0094\u0080â\u0094\u0080 assets - Custom assets: fonts, images, etcâ\u0080¦ â\u0094\u0082Â Â  â\u0094\u009câ\u0094\u0080â\u0094\u0080 components - Our reusable components, non-specific to our app â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080 e2e - Our protractor end to end tests â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080 server â\u0094\u009câ\u0094\u0080â\u0094\u0080 api - Our apps server api â\u0094\u009câ\u0094\u0080â\u0094\u0080 auth - For handling authentication with different auth strategies â\u0094\u009câ\u0094\u0080â\u0094\u0080 components - Our reusable or app-wide components â\u0094\u009câ\u0094\u0080â\u0094\u0080 config - Where we do the bulk of our apps configuration â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080 local.env.js - Keep our environment variables out of source control â\u0094\u0082Â Â  â\u0094\u0094â\u0094\u0080â\u0094\u0080 environment - Configuration specific to the node environment â\u0094\u0094â\u0094\u0080â\u0094\u0080 views - Server rendered views An example client component in client\/app main â\u0094\u009câ\u0094\u0080â\u0094\u0080 main.js - Routes â\u0094\u009câ\u0094\u0080â\u0094\u0080 main.controller.js - Controller for our main route â\u0094\u009câ\u0094\u0080â\u0094\u0080 main.controller.spec.js - Test â\u0094\u009câ\u0094\u0080â\u0094\u0080 main.html - View â\u0094\u0094â\u0094\u0080â\u0094\u0080 main.less - Styles An example server component in server\/api thing â\u0094\u009câ\u0094\u0080â\u0094\u0080 index.js - Routes â\u0094\u009câ\u0094\u0080â\u0094\u0080 thing.controller.js - Controller for our `thing` endpoint â\u0094\u009câ\u0094\u0080â\u0094\u0080 thing.model.js - Database model â\u0094\u009câ\u0094\u0080â\u0094\u0080 thing.socket.js - Register socket events â\u0094\u0094â\u0094\u0080â\u0094\u0080 thing.spec.js - Test","tags":"","url":"index.html"},{"title":"Prerequisites","text":"Prerequisites npm modules Make sure you have all the required Node dependencies available: npm install -g yo gulp-cli generator-angular-fullstack MongoDB If you're using MongoDB (which you probably are), you'll have to install it from here. You should then run the mongod process, which is in &lt;install_path&gt;\/MongoDB\/Server\/&lt;version&gt;\/bin\/. You'll also want a \/data\/db folder somewhere for Mongo to put your database in. It would be wise to make a script to automate this command, and maybe even run this script on your computer's startup. Example: #!\/bin\/bash \/var\/lib\/mongo\/server\/3.2\/bin\/mongod --dbpath \/data\/db node-gyp node-gyp is a cross-platform command-line tool written in Node.js for compiling native addon modules for Node.js. You'll need it for things like brotli compression. Read through the Installation section of the node-gyp readme. Basically you'll need Python 2.7, make, and a C\/C++ compiler (like GCC on unix, Xcode on OS X, or Visual Studio tools on Windows). To tell npm to use Python 2.7 (if you also have a different version installed), run npm config set python \/path\/to\/executable\/python2.7. Here's a snapshot of the instructions from their readme: On Unix: python (v2.7 recommended, v3.x.x is not supported) make A proper C\/C++ compiler toolchain, like GCC On Mac OS X: python (v2.7 recommended, v3.x.x is not supported) (already installed on Mac OS X) Xcode You also need to install the Command Line Tools via Xcode. You can find this under the menu Xcode -&gt; Preferences -&gt; Downloads This step will install gcc and the related toolchain containing make On Windows: Option 1: Install all the required tools and configurations using Microsoft's windows-build-tools using npm install --global --production windows-build-tools from an elevated PowerShell or CMD.exe (run as Administrator). Option 2: Install tools and configuration manually: Visual C++ Build Environment: Option 1: Install Visual C++ Build Tools using the Default Install option. Option 2: Install Visual Studio 2015 (or modify an existing installation) and select Common Tools for Visual C++ during setup. This also works with the free Community and Express for Desktop editions. :bulb: [Windows Vista \/ 7 only] requires .NET Framework 4.5.1 Install Python 2.7 (v3.x.x is not supported), and run npm config set python python2.7 (or see below for further instructions on specifying the proper Python version and path.) Launch cmd, npm config set msvs_version 2015 If the above steps didn't work for you, please visit Microsoft's Node.js Guidelines for Windows for additional tips. Create a new folder for your project Make a new directory, and cd into it: mkdir myapp &amp;&amp; cd $_","tags":"","url":"Getting_Started\/Prerequisites.html"},{"title":"Installation","text":"Installation Run yo angular-fullstack (optionally passing an app name): yo angular-fullstack You'll then be asked a series of questions regarding options for the generated app. Such things include using JavaScript or TypeScript, HTML or Pug, Bootstrap, SQL, and so on. If you don't know what to answer for a question, or just want to use our preferred options, hitting ENTER will use the default options for that question, and move on to the next one. Once you've answered all the questions, a project will be scaffolded for you according to the options you entered. Then, npm dependencies will automatically be installed. Once that's all complete, you're ready to get started with your app! Git Run the following: git init &amp;&amp; git add . &amp;&amp; git commit -m 'Initial Commit' Go to https:\/\/github.com\/new and enter a repository name. Click 'Create repository'. Then push to your remote repository with these commands: git remote add origin git@github.com:&lt;YOUR_USERNAME&gt;\/&lt;YOUR_APPNAME&gt;.git git push -u origin master Note: replace &lt;YOUR_USERNAME&gt; &amp; &lt;YOUR_APPNAME&gt; with your GitHub username and repository name. Commit early and commit often. Branches are cheap; use them often.","tags":"","url":"Getting_Started\/Installation.html"},{"title":"Running Your New App","text":"Running Your New App You can start your new app by running gulp serve. This will do some preliminary things like clean out temporary files, lint your scripts, inject any new CSS files into your main one, apply environment variables, and download any new TypeScript definitions. It will then start up a new development server, which will kick off a Webpack build. it uses Browser Sync to facilitate front-end development. Your files will also be watched for changes. Any front-end changes will kick off another webpack build. Any back-end changes will restart the back-end server, cleaning the development database and re-seeding it as well. Once the serve tasks are complete, a browser tab should be opened to your new app server.","tags":"","url":"Getting_Started\/Running_Your_New_App.html"},{"title":"Project Overview","text":"Project Overview What follows is an overfiew of the files\/folders in your newly generated project. Project Root .babelrc \/\/ configuration for [Babel], a JavaScript transpiler .editorconfig \/\/ config file used to keep conistent file editing across text editors .eslintrc \/\/ all of the rules applying to the ESLint JavaScript linter .travis.yml \/\/ a sample configuration file for Travis CI .yo-rc.json \/\/ a configuration file for the Angular Full-Stack Generator gulpfile.babel.js \/\/ Gulp task runner file karma.conf.js \/\/ Karma browser testing configuration mocha.conf.js \/\/ Mocha test framework configuration mocha.global.js \/\/ teardown file for Mocha package.json \/\/ npm manifest, contains information for all project dependencies protractor.conf.js \/\/ configuration for Protractor e2e test framework README.md \/\/ a readme file generator based on your options, for your scaffolded project spec.js \/\/ test file for Webpack used by Karma webpack.make.js \/\/ main file for Webpack configuration \/\/The following export the config from `webpack.make.js` for their respective build targets: webpack.dev.js webpack.test.js webpack.build.js client\/ â\u0094\u0082 .eslintrc \/\/ eslint config for client files â\u0094\u0082 polyfills.js \/\/ imports of polyfills â\u0094\u0082 _index.html \/\/ template for the root HTML file of your app â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080app â\u0094\u0082 â\u0094\u0082 app.config.js \/\/ contains app-wide configuration code â\u0094\u0082 â\u0094\u0082 app.constants.js \/\/ gets injected with constants from `server\/config\/environment\/shared.js` â\u0094\u0082 â\u0094\u0082 app.{js,ts} \/\/ root JavaScript file of your app â\u0094\u0082 â\u0094\u0082 app.{css,scss,stylus,less} \/\/ root CSS file of your app â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080account \/\/ pages related to login \/ signup \/ user settings â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 account.routes.js \/\/ route information â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 index.js \/\/ account module root â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080login â\u0094\u0082 â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080settings â\u0094\u0082 â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080signup â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080admin \/\/ site admin page â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080main \/\/ main component, homepage â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080assets \/\/ where static assets are stored â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080components â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080auth â\u0094\u0082 auth.module.js \/\/ module containing auth components â\u0094\u0082 auth.service.js \/\/ authentication service â\u0094\u0082 interceptor.service.js \/\/ intercepts requests and adds tokens if needed. Also redirects 401s to the login page. â\u0094\u0082 router.decorator.js \/\/ facilitates auth-based routing configuration â\u0094\u0082 user.service.js \/\/ user resource service â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080footer â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080modal â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080navbar â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080oauth-buttons \/\/ buttons for oauth login on signup \/ login pages â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080socket â\u0094\u0082 socket.mock.js \/\/ mock service for unit testing â\u0094\u0082 socket.service.js \/\/ service for Socket IO integration â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080ui-router â\u0094\u0082 ui-router.mock.js \/\/ mock service for unit testing â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080util \/\/ general utility service server\/ â\u0094\u0082 .eslintrc \/\/ server-specific ESLint config, imports rules from root file â\u0094\u0082 app.js \/\/ root server module â\u0094\u0082 index.js \/\/ imports `app.js`. Enables Babel require hook when in development mode. â\u0094\u0082 routes.js \/\/ imports \/ config for server endpoints â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080api â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080thing â\u0094\u0082 â\u0094\u0082 index.js \/\/ root module â\u0094\u0082 â\u0094\u0082 index.spec.js \/\/ root module tests â\u0094\u0082 â\u0094\u0082 thing.controller.js \/\/ endpoint logic â\u0094\u0082 â\u0094\u0082 thing.events.js \/\/ endpoint events (save, delete, etc) logic â\u0094\u0082 â\u0094\u0082 thing.integration.js \/\/ integration tests â\u0094\u0082 â\u0094\u0082 thing.model.js \/\/ Mongoose \/ Sequelize data model â\u0094\u0082 â\u0094\u0082 thing.socket.js \/\/ Socket IO logic \/ config â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080user \/\/ API for Users â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080auth â\u0094\u0082 â\u0094\u0082 auth.service.js â\u0094\u0082 â\u0094\u0082 index.js \/\/ imports local\/oauth auth modules â\u0094\u0082 â\u0094\u0082 â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080local \/\/ regular auth, signed up directly via your site â\u0094\u0082 â\u0094\u009câ\u0094\u0080â\u0094\u0080â\u0094\u0080google \/\/ Google OAuth â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080&lt;etc...&gt; â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080config â\u0094\u0082 express.js \/\/ Express server setup â\u0094\u0082 local.env.js \/\/ ignored by Git â\u0094\u0082 local.env.sample.js \/\/ sensitive environment variables are stored here, and added at server start. Copy to `local.env.js`. â\u0094\u0082 seed.js \/\/ re-seeds database with fresh data â\u0094\u0082 socketio.js \/\/ Socket IO configuration \/ imports â\u0094\u0082 â\u0094\u0094â\u0094\u0080â\u0094\u0080â\u0094\u0080environment development.js index.js production.js shared.js \/\/ config constants shared with the client code test.js e2e\/ End-To-End testing files (use by Protractor with Mocha)","tags":"","url":"Getting_Started\/Project_Overview.html"},{"title":"Starting Up","text":"Starting your app Now that you've gone through everything in the Getting Started section, lets get our app up and running. We do this by running the following: $ gulp serve We should see something like this spit out after it: $ gulp serve [12:15:45] Requiring external module babel-register (node:23392) fs: re-evaluating native module sources is not supported. If you are using the graceful-fs module, please update it to a more recent version. [12:16:03] Using gulpfile ~\/aftest\/gulpfile.babel.js (node:23392) DeprecationWarning: crypto.createCredentials is deprecated. Use tls.createSecureContext instead. (node:23392) DeprecationWarning: crypto.Credentials is deprecated. Use tls.SecureContext instead. [12:16:04] Starting 'serve'... [12:16:04] Starting 'clean:tmp'... [12:16:04] Starting 'lint:scripts'... [12:16:04] Starting 'lint:scripts:client'... [12:16:04] Starting 'lint:scripts:server'... [12:16:04] Starting 'inject'... [12:16:04] Starting 'inject:scss'... [12:16:04] Starting 'copy:fonts:dev'... [12:16:04] Starting 'env:all'... [12:16:04] Finished 'env:all' after 63 ms [12:16:04] Finished 'clean:tmp' after 370 ms [12:16:06] gulp-inject 6 files into app.scss. [12:16:06] Finished 'inject:scss' after 2.63 s [12:16:06] Finished 'inject' after 2.63 s [12:16:08] Finished 'copy:fonts:dev' after 4.04 s [12:16:08] Finished 'lint:scripts:server' after 4.74 s [12:16:09] Finished 'lint:scripts:client' after 5.33 s [12:16:09] Finished 'lint:scripts' after 5.33 s [12:16:09] Starting 'start:server'... [12:16:09] Finished 'start:server' after 16 ms [12:16:09] Starting 'start:client'... [nodemon] 1.9.2 [nodemon] to restart at any time, enter `rs` [nodemon] watching: \/home\/user\/aftest\/server\/**\/* [nodemon] starting `node server` (node:22180) DeprecationWarning: crypto.createCredentials is deprecated. Use tls.createSecureContext instead. (node:22180) DeprecationWarning: crypto.Credentials is deprecated. Use tls.SecureContext instead. Express server listening on 9000, in development mode (node:22180) DeprecationWarning: crypto.pbkdf2 without specifying a digest is deprecated. Please specify a digest [12:16:18] Finished 'start:client' after 8.97 s [12:16:18] Starting 'watch'... [12:16:18] Finished 'watch' after 234 ms [12:16:18] Finished 'serve' after 15 s finished populating users webpack: wait until bundle finished: \/ [BS] Proxying: http:\/\/localhost:9000 [BS] Access URLs: ---------------------------------- Local: http:\/\/localhost:3000 External: http:\/\/10.0.75.1:3000 ---------------------------------- UI: http:\/\/localhost:3002 UI External: http:\/\/10.0.75.1:3002 ---------------------------------- webpack done hook Hash: eb4e167635a3952856e9 Version: webpack 1.13.1 Time: 16538ms Asset Size Chunks Chunk Names app.bundle.js 2.83 MB 0 [emitted] app polyfills.bundle.js 209 kB 1 [emitted] polyfills vendor.bundle.js 2.62 MB 2 [emitted] vendor app.bundle.js.map 3.34 MB 0 [emitted] app polyfills.bundle.js.map 271 kB 1 [emitted] polyfills vendor.bundle.js.map 3.06 MB 2 [emitted] vendor ..\/client\/index.html 1.39 kB [emitted] Child html-webpack-plugin for &quot;..\\client\\index.html&quot;: Asset Size Chunks Chunk Names ..\/client\/index.html 2.69 kB 0 webpack: bundle is now VALID. And then our default browser should open up to the app: Fantastic! We're now up and running with our Full-Stack Angular web application! So what can it do? Homepage Assuming you scaffolded with a back-end database, you should see some 'features'. If you scaffolded with socket.io, you should see 'x' buttons next to each, and an input box. Try opening two browser windows to the same page side-by-side, and hitting the 'x' on one of the features. You should see the feature get removed on both web pages. Neat! This is because these database object changes are communicated to clients using socket.io. Neat. Let's see what else we can do. Auth Assuming you scaffolded with auth support, you should see a 'Sign Up' and a 'Log In' button at the top-right of your page. Let's go to the Log In page. You should see inputs for an email address and a password. When running your project in a devlopment environment, you'll get two user accounts automatically generated: Test User email: test@example.com password: test role: user Admin email: admin@example.com password: admin role: admin Go ahead and log in with the admin account, so we can see the extra admin bits too. You should then get sent back to the home page, but should notice that the navbar looks a bit different: First, at the top right, we see a greeting for our username, a cog icon (for user settings), and a logout button. Then, since we're an admin, we see a new 'Admin' state on the navbar. The admin section lists users and allows you to delete them. The user settings page allows you to change your password.","tags":"","url":"Developing\/Starting_Up.html"},{"title":"Adding a Route","text":"Adding a Route Alright, now let's add another route to our app. We'll call it 'foo'. We can easily do this with the yo angular-fullstack:route subgenerator command: $ yo angular-fullstack:route foo ? What module name would you like to use? (aftestApp.foo) ? What module name would you like to use? aftestApp.foo ? Where would you like to create this route? (client\/app\/) ? Where would you like to create this route? client\/app\/ ? What will the url of your route be? (\/foo) ? What will the url of your route be? \/foo identical client\\app\\foo\\foo.routes.js identical client\\app\\foo\\foo.component.js identical client\\app\\foo\\foo.component.spec.js identical client\\app\\foo\\foo.html identical client\\app\\foo\\foo.scss In the parent of this component, you should now import this component and add it as a dependency: import FooComponent from '.\/foo\/foo.component'; ... export angular.module('myParentModule', [FooComponent]); We give it our route name ('foo'), and a few more details: the name of the Angular module to create ('myApp.foo'), which folder to put the route under ('client\/app\/foo\/'), and the URL of the route ('localhost:3000\/foo'). This will create an Angular 1.5 component with an Angular module (foo.component.js), a template file (foo.html), a CSS file (foo.scss), a unit test file (foo.component.spec.js), and a routing file (foo.routes.js). Since we're using Webpack, We'll need to import our component somewhere. Since this is a generic app route (and for simplicity), we'll import it in app.js, under our root Angular module, like so: client\/app\/app.js ... import FooModule from '.\/foo\/foo.component'; angular.module('aftestApp', [ ... main, FooModule, ]) .config(routeConfig) .run(...); angular.element(document) .ready(() =&gt; { angular.bootstrap(document, ['aftestApp'], { strictDi: true }); }); Now that we've imported our new Angular module and added it to the dependency list of our root Angular module, we should be able to navigate to http:\/\/localhost:3000\/foo and see our new route: It's not a very impressive page right now, but it works. Now, our user's aren't going to know to go to the \/foo route. Let's add a navbar entry for it. client\/components\/navbar\/navbar.component.js import angular from 'angular'; export class NavbarComponent { menu = [{ title: 'Home', state: 'main' }, { title: 'Foo', state: 'foo' }]; isCollapsed = true; constructor(Auth) { 'ngInject'; this.isLoggedIn = Auth.isLoggedInSync; this.isAdmin = Auth.isAdminSync; this.getCurrentUser = Auth.getCurrentUserSync; } } export default angular.module('directives.navbar', []) .component('navbar', { template: require('.\/navbar.html'), controller: NavbarComponent }) .name; Easy enough. Now we should see our entry for 'Foo' in our navbar. It should also be highlighted if you're still on the '\/foo' route. You can read about all the other subgenerators that are available in the Generators section of the docs.","tags":"","url":"Developing\/Adding_a_Route.html"},{"title":"title","text":"[STUB] Deployment Manual (Linux server) Run gulp build. This will build your project into the dist folder by default. Zip up the contents of your dist folder and send it off to your server. On your server, unzip your built files somewhere on the disk. Ex: in a myproj folder. $ cd myproj $ npm install --production $ NODE_ENV=production node .\/server","tags":"","url":"Deployment\/title.html"},{"title":"title","text":"Contributing Releasing a new version Bump package.json version [ grunt conventionalChangelog cd angular-fullstack-deps git checkout master git pull cd .. gulp updateFixtures:deps cd angular-fullstack-deps git add . git commit -m $VERSION git push # npm publish ] git add .\/{CHANGELOG.md,angular-fullstack-deps,package.json} git commit -m $VERSION git push # npm publish","tags":"","url":"Contributing\/title.html"},{"title":"Commit Style","text":"Git Commit Guidelines These rules are adopted from the AngularJS project. Commit Message Format Each commit message consists of a header, a body and a footer. The header has a special format that includes a type, a scope and a subject: &lt;type&gt;(&lt;scope&gt;): &lt;subject&gt; &lt;BLANK LINE&gt; &lt;body&gt; &lt;BLANK LINE&gt; &lt;footer&gt; Any line of the commit message cannot be longer 100 characters! This allows the message to be easier to read on github as well as in various git tools. Type Must be one of the following: feat: A new feature fix: A bug fix docs: Documentation only changes style: Changes that do not affect the meaning of the code (white-space, formatting, missing semi-colons, etc) refactor: A code change that neither fixes a bug or adds a feature test: Adding missing tests chore: Changes to the build process or auxiliary tools and libraries such as documentation generation Scope The scope could be anything specifying place of the commit change. For example app, gen, docs, gen:view, gen:route, gen:service, etc... Subject The subject contains succinct description of the change: use the imperative, present tense: &quot;change&quot; not &quot;changed&quot; nor &quot;changes&quot; don't capitalize first letter no dot (.) at the end ###Body Just as in the subject, use the imperative, present tense: &quot;change&quot; not &quot;changed&quot; nor &quot;changes&quot; The body should include the motivation for the change and contrast this with previous behavior. ###Footer The footer should contain any information about Breaking Changes and is also the place to reference GitHub issues that this commit Closes. A detailed explanation can be found in this document.","tags":"","url":"Contributing\/Commit_Style.html"},{"title":"title","text":"[STUB]","tags":"","url":"Examples\/title.html"},{"title":"Heroku Deployment","text":"After you have generated the app, go to heroku.com and create and application manually (ex. foo-bar-42424). Then, starting frome the root folder, run the following commands: grunt build `cd dist heroku login (if you are not already authenticated) heroku git:remote -a foo-bar-42424 cd .. grunt build (not sure if this one is necessary) grunt buildcontrol:heroku -- @flaurian via #1966","tags":"","url":"Examples\/Heroku_Deployment.html"},{"title":"IIS","text":"Angular Full-Stack Generator deployment on Windows This is a walk through to get generator-angular-fullstack up and running on a windows machine. This walk through has been tested on: Windows Vista Windows 7 Windows 8 Windows Server 2008 (all builds\/ updates) Windows Server 2012 (all builds\/ updates) Prerequisites Install Python Download Python 2.7 from python.org\/downloads Install to C:\\Python27 (The Default Path) ** After Python is installed add the path (C:\\Python27\\) to your Windows PATH environment variable. Start &gt; Type Environment Variables &gt; click &quot;Edit the System Environment Variables&quot; &gt; Envrionment Variables &gt; Click &quot;Path&quot; &gt; &quot;Edit&quot; Add C:\\Python27\\python.exe to the very end. (Click into box and press 'End') Install NodeJS on Windows Download &amp; Install nvm-windows. Run nvm install 6.4.0 for the version of node that you want Run nvm use 6.4.0 to use that version Install IISNode Install Latest Stable release of IISNode Install IIS URL-Rewrite Module Install the URL-Rewrite Module extension Install MongoDB on Windows Download the current stable release of MongoDB from https:\/\/www.mongodb.org\/downloads and install using the &quot;Complete&quot; setup type and all the default options. Create the MongoDB data directory Create an empty folder at ex. C:\\data\\db. MongoDB requires a directory for storing all of it's data. The default directory is C:\\data\\db. You can use a different directory if you prefer by specifying the &quot;--dbpath&quot; parameter when starting the MongoDB server (below). Start the MongoDB server daemon by running mongod.exe from the command line. mongod.exe is likely located in C:\\Program Files\\MongoDB\\Server\\[MONGODB VERSION]\\bin; for example for version 3.2 the following command will start MongoDB: C:\\Program Files\\MongoDB\\Server\\3.2\\bin\\mongod Getting your project started Install the generator Create an empty folder for your project Open a terminal and change directories to your app's directory cd c:\\example Run npm install -g yo gulp-cli generator-angular-fullstack Run yo angular-fullstack Move App into production The below steps assume you have purchased a domain and have pointed your DNS to your public IP Build and prep Run the build process gulp serve:dist Move your dist\/ folder to your desired directory (This is where IIS will be pointed at) Copy the contents of the server\/ folder into your client\/ folder Copy down the web.config from below and place this inside your 'client' folder (save it as 'web.config') &lt;configuration&gt; &lt;system.webServer&gt; &lt;!-- indicates that the socketio.js file is a node.js application to be handled by the iisnode module --&gt; &lt;handlers&gt; &lt;add name=&quot;iisnode&quot; path=&quot;app.js&quot; verb=&quot;*&quot; modules=&quot;iisnode&quot; \/&gt; &lt;add name=&quot;iisnode-socketio&quot; path=&quot;config\/socketio.js&quot; verb=&quot;*&quot; modules=&quot;iisnode&quot; \/&gt; &lt;\/handlers&gt; &lt;iisnode node_env=&quot;PRODUCTION&quot; nodeProcessCountPerApplication=&quot;1&quot; maxConcurrentRequestsPerProcess=&quot;1024&quot; maxNamedPipeConnectionRetry=&quot;100&quot; namedPipeConnectionRetryDelay=&quot;250&quot; maxNamedPipeConnectionPoolSize=&quot;512&quot; maxNamedPipePooledConnectionAge=&quot;30000&quot; asyncCompletionThreadCount=&quot;0&quot; initialRequestBufferSize=&quot;4096&quot; maxRequestBufferSize=&quot;65536&quot; uncFileChangesPollingInterval=&quot;5000&quot; gracefulShutdownTimeout=&quot;60000&quot; loggingEnabled=&quot;true&quot; logDirectory=&quot;iisnode&quot; debuggingEnabled=&quot;true&quot; debugHeaderEnabled=&quot;false&quot; debuggerPortRange=&quot;5058-6058&quot; debuggerPathSegment=&quot;debug&quot; maxLogFileSizeInKB=&quot;128&quot; maxTotalLogFileSizeInKB=&quot;1024&quot; maxLogFiles=&quot;20&quot; devErrorsEnabled=&quot;true&quot; flushResponse=&quot;false&quot; enableXFF=&quot;false&quot; promoteServerVars=&quot;&quot; configOverrides=&quot;iisnode.yml&quot; watchedFiles=&quot;web.config;*.js&quot; \/&gt; &lt;!-- indicate that all strafic the URL paths beginning with 'socket.io' should be redirected to the server socketio.js, node.js, application to avoid IIS attempting to serve that content using other handlers (e.g. static file handlers) --&gt; &lt;rewrite&gt; &lt;rules&gt; &lt;rule name=&quot;LogFile&quot; patternSyntax=&quot;ECMAScript&quot;&gt; &lt;match url=&quot;socket.io&quot;\/&gt; &lt;action type=&quot;Rewrite&quot; url=&quot;app.js&quot;\/&gt; &lt;\/rule&gt; &lt;rule name=&quot;DynamicContent&quot;&gt; &lt;conditions&gt; &lt;add input=&quot;{REQUEST_FILENAME}&quot; matchType=&quot;IsFile&quot; negate=&quot;True&quot;\/&gt; &lt;\/conditions&gt; &lt;action type=&quot;Rewrite&quot; url=&quot;app.js&quot;\/&gt; &lt;\/rule&gt; &lt;\/rules&gt; &lt;\/rewrite&gt; &lt;!-- disable the IIS websocket module to allow node.js to provide its own WebSocket implementation --&gt; &lt;webSocket enabled=&quot;false&quot; \/&gt; &lt;\/system.webServer&gt; &lt;\/configuration&gt; Setup IIS (if new build in IIS) Open IIS Manager (Start &gt; Type 'IIS Manager') Create your new site (Expand Server &gt; Right click sites &gt; 'Add Websites') Enter your site's name Enter the directory path to your client\/ folder (C:\\example\\dist\\client\\) Enter your hostname (Your a-record) Leave all other defaults and click 'Ok' Congratulations, you did it! Now go code something awesome!","tags":"","url":"Examples\/IIS.html"},{"title":"Modal","text":"[stub]","tags":"","url":"Examples\/Modal.html"},{"title":"app","text":"App Sets up a new AngularJS + Express app, generating all the boilerplate you need to get started. Usage: Usage: yo angular-fullstack [options] [&lt;name&gt;] yo angular-fullstack:app [options] [&lt;name&gt;] Options: -h, --help # Print the generator's options and usage --skip-cache # Do not remember prompt answers Default: false --skip-install # Do not install dependencies Default: false --skip-config # Always use existing .yo-rc.json Default: false --app-suffix # Allow a custom suffix to be added to the module name Default: App --dev-port # Port to use for the development HTTP server Default: 9000 --debug-port # Port to use for the server debugger Default: 5858 --prod-port # Port to use for the production HTTP Server Default: 8080 Arguments: name Type: String Required: false","tags":"","url":"Generators\/app.html"},{"title":"component","text":"Component Generates an Angular 1.5 component. Example: yo angular-fullstack:component name [?] What module name would you like to use? myApp.name [?] Where would you like to create this component? client\/app\/ Produces: client\/app\/name\/name.component.js client\/app\/name\/name.component.spec.js","tags":"","url":"Generators\/component.html"},{"title":"controller","text":"Controller Generates a controller. Example: yo angular-fullstack:controller user [?] What module name would you like to use? myApp.user [?] Where would you like to create this controller? client\/app\/ Produces: client\/app\/user\/user.controller.js client\/app\/user\/user.controller.spec.js","tags":"","url":"Generators\/controller.html"},{"title":"decorator","text":"Decorator Generates an AngularJS service decorator. Example: yo angular-fullstack:decorator serviceName [?] What module name would you like to use? myApp.serviceName [?] Where would you like to create this decorator? client\/app\/ Produces client\/app\/serviceName\/serviceName.decorator.js","tags":"","url":"Generators\/decorator.html"},{"title":"directive","text":"Directive Generates a directive. Example: yo angular-fullstack:directive myDirective [?] What module name would you like to use? myApp.myDirective [?] Where would you like to create this directive? client\/app\/ [?] Does this directive need an external html file? Yes Produces: client\/app\/myDirective\/myDirective.directive.js client\/app\/myDirective\/myDirective.directive.spec.js client\/app\/myDirective\/myDirective.html client\/app\/myDirective\/myDirective.scss Simple directive without an html file Example: yo angular-fullstack:directive simple [?] What module name would you like to use? myApp.simple [?] Where would you like to create this directive? client\/app\/ [?] Does this directive need an external html file? No Produces: client\/app\/simple\/simple.directive.js client\/app\/simple\/simple.directive.spec.js","tags":"","url":"Generators\/directive.html"},{"title":"endpoint","text":"Endpoint Generates a new API endpoint. Usage: Usage: yo angular-fullstack:endpoint [options] &lt;name&gt; Options: -h, --help # Print the generator's options and usage --skip-cache # Do not remember prompt answers Default: false --route # URL for the endpoint --models # Specify which model(s) to use Options: mongoose, sequelize --endpointDirectory # Parent directory for enpoints Arguments: name Type: String Required: true Example: yo angular-fullstack:endpoint message [?] What will the url of your endpoint be? \/api\/messages Produces: server\/api\/message\/index.js server\/api\/message\/index.spec.js server\/api\/message\/message.controller.js server\/api\/message\/message.integration.js server\/api\/message\/message.model.js (optional) server\/api\/message\/message.events.js (optional) server\/api\/message\/message.socket.js (optional)","tags":"","url":"Generators\/endpoint.html"},{"title":"filter","text":"Filter Generates a filter. Example: yo angular-fullstack:filter myFilter [?] What module name would you like to use? myApp.myFilter [?] Where would you like to create this filter? client\/app\/ Produces: client\/app\/myFilter\/myFilter.filter.js client\/app\/myFilter\/myFilter.filter.spec.js","tags":"","url":"Generators\/filter.html"},{"title":"heroku","text":"Heroku Setup You need a Heroku account and have the Heroku Toolbelt installed. Create an app on Heroku and give it a name (e.g. myapp) : heroku apps:create myapp You can also use Heroku dashboard to create an app. If you're using mongoDB you will need to add a database to your app (e.g. mlab or compose): Here we use mlab: heroku addons:create mongolab Now, build your app by running: gulp build This creates a folder called dist. Now go to dist and set it up as a git repository: git init Add Heroku's app as your dist folder's remote repository: heroku git:remote -a myapp It is time to push your local repository to Heroku. From your app's root run: gulp buildcontrol:heroku Your app should be live now. To view your app run: heroku open Note on MongoDB setup: if you get an Error: No valid replicaset instance servers found you need to modify moongose connection options in config\/environment\/production.js as follows: options: { db: { safe: true, replset: { socketOptions: { keepAlive: 1, connectTimeoutMS: 30000 } }, server: { socketOptions: { keepAlive: 1, connectTimeoutMS: 30000 } } } } One of the odd things about the Node driver is that the default timeout for replica set connections is only 1 second, so make sure you're setting it to something more like 30s like in this example. If you're using any oAuth strategies, you must set environment variables for your selected oAuth. For example, if we're using Facebook oAuth we would do this : heroku config:set FACEBOOK_ID=id heroku config:set FACEBOOK_SECRET=secret You will also need to set DOMAIN environment variable: heroku config:set DOMAIN=&lt;your-heroku-app-name&gt;.herokuapp.com # or (if you're using it): heroku config:set DOMAIN=&lt;your-custom-domain&gt; Pushing Updates gulp build Commit and push the resulting build, located in your dist folder: gulp buildcontrol:heroku","tags":"","url":"Generators\/heroku.html"},{"title":"openshift","text":"###Openshift Note: Openshift uses a quite old version of Node by default. We strongly recommend updating your Node version. Here's a helpful article. Deploying to OpenShift can be done in just a few steps: yo angular-fullstack:openshift A live application URL will be available in the output. oAuth If you're using any oAuth strategies, you must set environment variables for your selected oAuth. For example, if we're using Facebook oAuth we would do this : rhc set-env FACEBOOK_ID=id -a my-openshift-app rhc set-env FACEBOOK_SECRET=secret -a my-openshift-app You will also need to set DOMAIN environment variable: rhc set-env DOMAIN=&lt;your-openshift-app-name&gt;.rhcloud.com # or (if you're using it): rhc set-env DOMAIN=&lt;your-custom-domain&gt; After you've set the required environment variables, restart the server: rhc app-restart -a my-openshift-app To make your deployment process easier consider using grunt-build-control. Pushing Updates gulp build Commit and push the resulting build, located in your dist folder: gulp buildcontrol:openshift","tags":"","url":"Generators\/openshift.html"},{"title":"route","text":"Route Generates a new route. Example: yo angular-fullstack:route myroute [?] What module name would you like to use? myApp.myroute [?] Where would you like to create this route? client\/app\/ [?] What will the url of your route be? \/myroute Produces: client\/app\/myroute\/myroute.js client\/app\/myroute\/myroute.component.js client\/app\/myroute\/myroute.component.spec.js client\/app\/myroute\/myroute.html client\/app\/myroute\/myroute.scss Your new myroute.component.js will contain Angular code registering a new module, defaulting to myApp.myRoute. The default export of the component will be this name. Make sure to import this name in a parent Angular module, and add it as a dependency like so: import MyRouteModule from '.\/myroute\/myroute.component'; ... angular.module('myApp.myParent', [MyRouteModule]);","tags":"","url":"Generators\/route.html"},{"title":"service","text":"Service Generates an AngularJS service. Example: yo angular-fullstack:service myService [?] What module name would you like to use? myApp.myService [?] Where would you like to create this service? client\/app\/ Produces: client\/app\/myService\/myService.service.js client\/app\/myService\/myService.service.spec.js You can also do yo angular-fullstack:factory and yo angular-fullstack:provider for other types of services.","tags":"","url":"Generators\/service.html"}]}